# Join our Results

### 1. Loading Libraries

In [11]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

### 2. Loading Files

In [12]:
sarima = pd.read_csv('../data/CSV/SarimaForecast_allDistricts_Tableau.csv',index_col=0)
prophet = pd.read_csv('../data/CSV/ProphetForecast_allDistricts_Tableau.csv',index_col=0)
rmse_sarima = pd.read_csv('../data/CSV/rmse_sarima.csv')
rmse_prophet = pd.read_csv('../data/CSV/rmse_prophet.csv')
# keras
# keras rmse

In [13]:
sarima.head()

             values district         type   model  DISTRICT_
2006-01-31  19359.0     city  Time Series  sarima          0
2006-02-28  15894.0     city  Time Series  sarima          0
2006-03-31  18627.0     city  Time Series  sarima          0
2006-04-30  18940.0     city  Time Series  sarima          0
2006-05-31  20041.0     city  Time Series  sarima          0

In [14]:
prophet.head()

             values district         type    model  DISTRICT_
ds
2006-01-31  19359.0     city  Time Series  prophet          0
2006-02-28  15894.0     city  Time Series  prophet          0
2006-03-31  18627.0     city  Time Series  prophet          0
2006-04-30  18940.0     city  Time Series  prophet          0
2006-05-31  20041.0     city  Time Series  prophet          0

In [15]:
rmse_sarima.head()

         rmse      testMean district   model  DISTRICT_
0  374.879282  13552.916667     city  sarima          0
1   33.849280    216.750000   dist_1  sarima          1
2   65.095571    582.083333   dist_2  sarima          2
3   46.700909    729.083333  dist_18  sarima         18
4    6.987550     54.250000  dist_77  sarima         77

In [16]:
rmse_prophet.head()

         rmse      testMean district    model  DISTRICT_
0  482.438110  13552.916667     city  prophet          0
1   22.213596    216.750000   dist_1  prophet          1
2   58.927466    582.083333   dist_2  prophet          2
3   49.062053    729.083333  dist_18  prophet         18
4    8.538541     54.250000  dist_77  prophet         77

### 3. Append DataFrames

In [17]:
models = sarima.append(prophet)

In [18]:
models.head()

             values district         type   model  DISTRICT_
2006-01-31  19359.0     city  Time Series  sarima          0
2006-02-28  15894.0     city  Time Series  sarima          0
2006-03-31  18627.0     city  Time Series  sarima          0
2006-04-30  18940.0     city  Time Series  sarima          0
2006-05-31  20041.0     city  Time Series  sarima          0

In [19]:
rmse = rmse_sarima.append(rmse_prophet)

In [20]:
rmse.head()

         rmse      testMean district   model  DISTRICT_
0  374.879282  13552.916667     city  sarima          0
1   33.849280    216.750000   dist_1  sarima          1
2   65.095571    582.083333   dist_2  sarima          2
3   46.700909    729.083333  dist_18  sarima         18
4    6.987550     54.250000  dist_77  sarima         77

### 4. Save File

In [21]:
models.to_csv('../data/CSV/models_allDistricts_Tableau.csv')
rmse.to_csv('../data/CSV/rmse_models.csv',index=False)